{
  "navbar_home": "Головна",
  "navbar_about": "Про мене",
  "navbar_projects": "Проекти",
  "navbar_resume": "Резюме",
  "home_hi_there": "Привіт!",
  "home_im": "Я - ",
  "home_name": "Олексій",
  "home_introduce_myself": "ТРОШКИ ІНФОРМАЦІІ ПРО",
  "home_introduce": "МЕНЕ",
  "home_about_description1": "У світі DevOps я прагну до високого професіоналізму та успішно вирішую завдання в різноманітних технічних середовищах.",
  "home_about_description2": "Моя експертиза включає використання Docker та Kubernetes для розробки надійних рішень, і я вміло використовую Jenkins для автоматизації та оптимізації системних процесів.",
  "home_about_description3": "Я зосереджений на створенні та оптимізації масштабованих хмарних рішень на платформах, таких як GCP та AWS, для досягнення максимальної ефективності.",
  "home_about_description4": "Дотримуючись принципів, я прагну покращувати процеси управління проектами та сприяти неперервному інноваційному розвитку інфраструктури системи.",
  "home_find_me_on": "ЗНАЙДІТЬ МЕНЕ НА",
  "home_connect_with_me": "Не соромтеся зв'язатися зі мною",
  "type_certified_professional": "Сертифікований професіонал з хмарних рішень за напрямом DevOps",
  "type_linux_system_admin": "Адміністратор Linux та Windows систем",
  "type_dreamy_devops": "Мрійливий DevOps-інженер",
  "type_atlassian_administrator": "Адміністратор Atlassian",
  "type_computer_system_engineer": "Інженер з комп'ютерних систем",
  "type_newbie_web_developer": "Трошки веб-розробник",
  "type_ethnical_hacker": "Маю сертифікат Ethical hacker від Cisco",
  "about_title": "Дізнайтеся, хто я",
  "professional_skillset": "Професійні навички",
  "tools_i_use": "Інструменти, які я використовую",
  "about_card_intro": "Привіт усім, мене звати",
  "about_card_from": "я родом з ",
  "about_card_country": "України",
  "about_card_currently_looking": "Розвиваючись у галузі DevOps та Site Reliability Engineering, я крок за кроком просуваюся до своєї мрії.",
  "about_card_certification": "Я отримав статус Сертифікованого професіонала з DevOps-інженерії від Google Cloud",
  "about_card_activities_intro": "Крім самоосвіти, я також залучаюся до різних інших активностей!",
  "about_card_activity_sport": "Спорт",
  "about_card_activity_tv": "Перегляд телешоу",
  "about_card_activity_reading": "Читання книг",
  "about_card_quote": "\"DevOpsDive: Інженерія рішень завтрашнього дня, вже сьогодні!\"",
  "bages_and_certificates": "Мої Бейджи та Сертифікати",
  "click_to_verify": "натисни для верифікації",
  "github_days_i_code": "Дні, коли я трошки пишу",
  "github_code": "код",
  "github_web_hobby": "Веб - моє хобі",
  "projects_my_recent_works": "Мої останні роботи",
  "projects_description": "Ось декілька проектів, якими я займався останнім часом.",
  "project_import_automation_title": "Інструмент автоматизації імпорту даних",
  "project_import_automation_description": "Розробив універсальний інструмент для автоматизації завдань імпорту в різних середовищах. Підвищив операційну ефективність шляхом спрощення складних процесів, скоротивши час з 15-20 хвилин до 1-2 хвилин на один імпорт. Використав Azure Automation для безпечного виконання з належною обробкою помилок.",
  "project_logs_viewer_title": "Додаток для перегляду логів eShop",
  "project_logs_viewer_description": "Створив зручний веб-додаток для доступу до логів кластера AKS, що дозволяє командам підтримки швидко отримувати та аналізувати логи без знання Azure Log Analytics. Скоротив час доступу до логів з 5-10 хвилин до 30-60 секунд і впровадив функцію завантаження логів в один клік.",
  "project_api_clients_tool_title": "Інструмент для виявлення невикористовуваних API-клієнтів Commercetools",
  "project_api_clients_tool_description": "Розробив інструмент на Python для виявлення невикористовуваних API-клієнтів у кількох проектах Commercetools, знижуючи ризики безпеки та покращуючи управління життєвим циклом клієнтів. Автоматизував раніше ручні процеси аудиту, скоротивши час аналізу з годин до хвилин і надаючи вичерпні звіти.",
  "project_jira_title": "Розгортання та автоматизація Jira",
  "project_jira_description": "Розгорнув Jira для управління проектами, налаштував її за допомогою автоматичних скриптів для відстеження завдань, планування спринтів та робочих процесів команди, тим самим підвищивши продуктивність та відповідність методам Agile.",
  "project_docker_compose_title": "Інфраструктура з використанням Docker-compose",
  "project_docker_compose_description": "Створив інфраструктуру з використанням Docker-compose, з'єднавши сайт WordPress з базою даних MySQL. Налаштував сервер WordPress на порту 8080 і налаштував MySQL для ефективної взаємодії з сайтом.",
  "project_proxmox_title": "Віртуальний центр даних Proxmox",
  "project_proxmox_description": "Розгорнув віртуальний центр даних на основі Proxmox, керуючи віртуальними машинами та забезпечуючи високу надійність з регулярними резервними копіями. Ця настройка гарантує продуктивність і безпеку для всіх служб.",
  "project_nginx_title": "Налаштування Nginx",
  "project_nginx_description": "Налаштував Nginx для підключення домену та SSL, підвищивши безпеку та ефективність веб-сервісу. Підстроїв серверні блоки для покращення продуктивності, встановив SSL для шифрування передачі даних.",
  "project_jenkins_title": "Впровадження Jenkins",
  "project_jenkins_description": "Налаштував Jenkins для автоматизованих робочих процесів та неперервної інтеграції, налаштувавши конвеєри та інтегрувавши їх з системами управління версіями. Це підвищило ефективність, швидкість та послідовність розробки.",
  "project_phbt_title": "CRM-система для Pharmbiotest",
  "project_phbt_description": "Розробив спеціалізовану CRM-систему для Pharmbiotest, покращивши відстеження обслуговування, керування базою даних клієнтів та програми лояльності. Оптимізував для поліпшення взаємодії з клієнтами та оптимізації доставки послуг за допомогою передових інструментів баз даних.",
  "project_landing_title": "Адаптивна лендінг-сторінка",
  "project_landing_description": "Створив адаптивну лендінг-сторінку з використанням HTML та CSS, з акцентом на адаптивному дизайні. Застосував передовий CSS для гнучкості на різних пристроях, забезпечуючи безперебійну взаємодію з користувачем.",
  "project_multipage_title": "Інтернет-магазин Foxtar",
  "project_multipage_description": "Розробив інтернет-магазин Foxtar, обширну онлайн-платформу з дружнім дизайном. Впровадив функції електронної комерції, такі як списки продуктів та кошик для повного досвіду покупок.",
  "project_calculator_title": "Калькулятор за допомогою Vue.js",
  "project_calculator_description": "Створив інтерактивний калькулятор за допомогою Vue.js з можливістю скасування та повтору дій. Цей проект демонструє можливості Vue.js у сфері реактивності та управління станом.",
  "project_chess_title": "Шахи за допомогою React",
  "project_chess_description": "Розробив двохгравцеву шахову гру за допомогою React, інтегруючи класичні правила в динамічний інтерфейс. Ефективно керував станом гри для покращеної стратегічної гри.",
  "project_fakestore_title": "Додаток Fake Store",
  "project_fakestore_description": "Розробив додаток на React, що імітує досвід електронної комерції за допомогою FakeStoreAPI. Можливості включають перегляд товарів, їх додавання до кошика та взаємодію з API.",
  "project_searchapp_title": "Додаток для пошуку репозиторіїв GitHub",
  "project_searchapp_description": "Створив веб-додаток для пошуку репозиторіїв на GitHub, що дозволяє користувачам шукати, переглядати деталі та зберігати улюблені репозиторії. Використовує API GitHub для отримання даних у реальному часі.",
  "download_cv": "Завантажити резюме",
  "select_en_resume": "Англійська версія резюме",
  "select_ua_resume": "Українська версія резюме",
  "select_ru_resume": "Російська версія резюме",
  "footer_copywright_1": "Інженерія рішень завтрашнього дня, вже сьогодні!",
  "footer_copywright_2": "Авторські права © {{year}} DevOpsDive",
  "all": "Всі",
  "type_project": "Проект",
  "type_task": "Завдання",
  "category_cloud": "Хмарні сервіси",
  "category_cicd": "CI/CD та контейнери",
  "category_monitoring": "Моніторинг та логування",
  "category_iac": "Інфраструктура як код",
  "category_security": "Безпека",
  "category_automation": "Автоматизація",
  "category_infrastructure": "Інфраструктура",
  "active_filters": "Активні фільтри",
  "clear_all": "Очистити все",
  "showing_results": "Показано {{count}} результатів",
  "no_results": "Проекти не знайдено",
  "try_different_filters": "Спробуйте інші фільтри",
  "reset_all_filters": "Скинути всі фільтри",
  "task_kubernetes_title": "Розгортання Kubernetes",
  "task_kubernetes_description": "Налаштував кластер Kubernetes та розгорнув мікросервіси з автоматичним масштабуванням та моніторингом.",
  "task_aws_title": "Налаштування інфраструктури AWS",
  "task_aws_description": "Впровадив інфраструктуру AWS використовуючи Terraform, включаючи налаштування VPC, EC2 та RDS.",
  "task_elk_title": "Впровадження ELK Stack",
  "task_elk_description": "Впровадив ELK stack для централізованого логування та моніторингу додатків.",
  "task_cloud_migration_title": "Проект міграції в хмару",
  "task_cloud_migration_description": "Виконав міграцію локальних додатків до хмарної платформи використовуючи інфраструктуру як код.",
  "category_cloud_engineering": "Хмарна інженерія та архітектура",
  "category_containerization": "Контейнеризація та оркестрація",
  "category_automation_cicd": "CI/CD та автоматизація розгортання",
  "category_monitoring_reliability": "Моніторинг та SRE",
  "category_cloud_engineering_hint": "Експертиза в хмарних платформах: AWS, Azure, GCP та хмарних технологіях",
  "category_containerization_hint": "Контейнерні технології: Kubernetes, Docker та мікросервісна архітектура",
  "category_automation_cicd_hint": "Неперервна інтеграція/доставка та автоматизація розгортання",
  "category_infrastructure_hint": "Інфраструктура як код та системна архітектура",
  "category_monitoring_reliability_hint": "Системний моніторинг, спостережуваність та інженерія надійності сайтів",
  "category_security_hint": "Реалізація безпеки та стандарти відповідності",
  "task_git_optimization_title": "Оптимізація Git-репозиторіїв",
  "task_git_optimization_description": "Оптимізував робочі процеси Git, впровадивши ефективні стратегії гілкування та дзеркалювання репозиторіїв, що забезпечило швидшу співпрацю та значне скорочення сховища.",
  "task_backup_solution_title": "Хмарне рішення для резервного копіювання",
  "task_backup_solution_description": "Розробив автоматизоване рішення для резервного копіювання на базі Azure для Commercetools з проактивною верифікацією, забезпечуючи захист даних, швидке відновлення та безперервність бізнесу.",
  "task_kubernetes_setup_title": "Налаштування інфраструктури Kubernetes",
  "task_kubernetes_setup_description": "Налаштував інфраструктуру Kubernetes з оптимізованим ingress та автоматичним масштабуванням мікросервісів, підвищуючи безпеку, доступність та операційну ефективність.",
  "project_bosch_cicd_title": "CI/CD конвеєр для корпоративної електронної комерції",
  "project_bosch_cicd_description": "Створив CI/CD конвеєри для платформи електронної комерції Bosch з використанням Jenkins та Azure DevOps, інтегрував автоматизоване тестування та прискорив розгортання мікросервісів з Commercetools.",
  "project_gcp_kubernetes_title": "Інфраструктура Kubernetes на GCP",
  "project_gcp_kubernetes_description": "Побудував інфраструктуру Kubernetes на Google Cloud Platform, включаючи кластери з автомасштабуванням, політики безпеки подів, балансування навантаження та інтегрований Cloud Monitoring для покращеної спостережуваності.",
  "project_multicloud_security_title": "Мультихмарна система безпеки",
  "project_multicloud_security_description": "Розробив комплексну систему безпеки для GCP, AWS та Azure. Впровадив політики IAM, групи безпеки та мережеві політики. Створив автоматизовані перевірки відповідності безпеки та процедури усунення проблем. Після впровадження не було зафіксовано жодного інциденту безпеки.",
  "project_terraform_automation_title": "Платформа інфраструктури як код",
  "project_terraform_automation_description": "Створив корпоративну платформу Infrastructure as Code з використанням Terraform для мультихмарних розгортань. Реалізував модульний дизайн для багаторазових компонентів, автоматизоване управління станом та інтеграцію з CI/CD конвеєрами. Скоротив час розгортання інфраструктури на 80%.",
  "project_monitoring_platform_title": "Корпоративне рішення для моніторингу",
  "project_monitoring_platform_description": "Впровадив корпоративну платформу моніторингу з використанням Grafana, Prometheus та користувацьких експортерів, забезпечуючи сповіщення в реальному часі, ефективне реагування на інциденти та підвищений час роботи системи.",
  "task_lambda_migration_title": "Міграція AWS Lambda на Python",
  "task_lambda_migration_description": "Мігрував понад 50 функцій AWS Lambda на Python 3.11 без простоїв, інтегрувавши автоматизоване тестування та конвеєри для підвищення безпеки та узгодженості розгортання.",
  "task_terraform_azure_title": "Автоматизація інфраструктури Azure",
  "task_terraform_azure_description": "Автоматизував розгортання Azure з використанням Terraform з модульними мережевими компонентами, скоротивши час надання ресурсів та забезпечивши надійну інфраструктуру та безпеку.",
  "task_microservices_deployment_title": "Налаштування платформи мікросервісів",
  "task_microservices_deployment_description": "Налаштував архітектуру мікросервісів на основі MACH з API-шлюзами та автоматичним масштабуванням, значно підвищивши швидкість розгортання, надійність та гнучкість.",
  "project_commercetools_backup_title": "Рішення для резервного копіювання даних Commercetools",
  "project_commercetools_backup_description": "Створив автоматизоване рішення для резервного копіювання Commercetools з використанням Azure Logic Apps, включаючи плановані резервні копії, перевірку даних та відновлення, забезпечуючи надійність та швидке відновлення.",
  "project_git_optimization_title": "Оптимізація Git-інфраструктури",
  "project_git_optimization_description": "Оптимізував Git-репозиторії з ефективним гілкуванням та дзеркалюванням GitLab-Bitbucket, зменшивши сховище на 40% та час збірки на 50%, покращивши співпрацю між командами.",
  "project_mach_deployment_title": "Платформа автоматизації MACH Composer",
  "project_mach_deployment_description": "Оптимізував розгортання мікросервісів з використанням MACH Composer та GitHub Actions, забезпечивши багаторазові робочі процеси, конфігурації для конкретних середовищ та автоматизоване тестування для швидших та безпомилкових релізів.",
  "task_backup_monitoring_title": "Система моніторингу резервного копіювання",
  "task_backup_monitoring_description": "Впровадив моніторинг резервного копіювання на базі Azure, автоматизуючи сповіщення, забезпечуючи швидке вирішення проблем та підтримуючи високу надійність даних.",
  "task_git_workflow_title": "Автоматизація робочого процесу Git",
  "task_git_workflow_description": "Автоматизував робочі процеси Git зі структурованими стратегіями гілкування, попередніми перевірками перед комітом та контролем якості, підвищуючи якість коду, узгодженість та продуктивність.",
  "task_mach_testing_title": "Інтеграційне тестування MACH",
  "task_mach_testing_description": "Розробив автоматизовані інтеграційні тести для мікросервісів на базі MACH, забезпечуючи високу надійність, надійні API та значно знижуючи ризики розгортання.",
  "project_git_mirror_title": "Рішення для синхронізації Git між платформами",
  "project_git_mirror_description": "Реалізував безшовну синхронізацію репозиторіїв між BitBucket та GitLab, забезпечуючи ефективну міжкомандну співпрацю, узгодженість коду в реальному часі та спрощене управління доступом.",
  "task_mirror_monitoring_title": "Моніторинг синхронізації репозиторіїв",
  "task_mirror_monitoring_description": "Створив моніторинг у реальному часі для процесів синхронізації Git-репозиторіїв, забезпечуючи швидке виявлення збоїв, сповіщення та підтримку узгодженості коду на різних платформах.",
  "project_gke_migration_title": "Міграція платформи електронної комерції на GKE",
  "project_gke_migration_description": "Переніс платформу електронної комерції на Google Kubernetes Engine, впровадивши мікросервіси, автоматичне масштабування та моніторинг. Зменшив час відгуку, підвищив надійність та знизив витрати на інфраструктуру.",
  "project_network_security_title": "Впровадження мережевої безпеки GCP",
  "project_network_security_description": "Впровадив комплексне рішення мережевої безпеки, включаючи налаштування бастіон-хостів, конфігурацію IAP та сегментацію мережі. Усунув інциденти безпеки та досяг повної ізоляції мережі з контрольованими точками доступу.",
  "project_infrastructure_auto_title": "Автоматизація корпоративної інфраструктури",
  "project_infrastructure_auto_description": "Розробив повну автоматизацію інфраструктури для роздрібної платформи з використанням Terraform. Скоротив час підготовки з 7 днів до 25 хвилин, досяг 99,8% точності конфігурації та оптимізував використання ресурсів до 78%.",
  "project_canary_deployment_title": "Система поетапного розгортання Cloud Run",
  "project_canary_deployment_description": "Впровадив систему прогресивної доставки з використанням Cloud Run з канарейковими розгортаннями. Забезпечив розгортання без простоїв, знизив ризики розгортання на 95% та заощадив 180 тис. доларів на квартал завдяки запобіганню інцидентам.",
  "project_load_balancer_title": "Впровадження глобального HTTP-балансувальника навантаження",
  "project_load_balancer_description": "Спроектував та впровадив рішення глобального балансування HTTP-навантаження, підвищивши доступність з 98,5% до 99,99%. Скоротив час відгуку з 2,5 с до 0,8 с та забезпечив автоматичне масштабування між регіонами.",
  "project_cicd_pipeline_title": "CI/CD конвеєр для електронної комерції",
  "project_cicd_pipeline_description": "Трансформував процес розгортання для платформи електронної комерції, скоротивши час розгортання з 4 годин до 12 хвилин. Досяг 99,9% успішності розгортання та реалізував можливість миттєвого відкату.",
  "project_azure_infrastructure_title": "Корпоративна інфраструктура Azure",
  "project_azure_infrastructure_description": "Розробив інфраструктуру Azure з Terraform та GitHub Actions, автоматизувавши безпечне розгортання мікросервісів. Інтегрував комплексний моніторинг для підвищення надійності та прискорення циклів випуску.",
  "project_aws_lambda_title": "Міграція та безпека AWS Lambda",
  "project_aws_lambda_description": "Успішно мігрував понад 50 функцій AWS Lambda на Python 3.11, впровадив оцінку безпеки, автоматизоване тестування та представив експертизу на заходах AWS Weeks 2024.",
  "project_terraform_infrastructure_title": "Інфраструктура для IT Marathon",
  "project_terraform_infrastructure_description": "Спроектував безпечну хмарну інфраструктуру з використанням Terraform, впровадивши VPC, Security Groups та автоматизоване управління DNS. Представив рішення для понад 500 учасників на конференції EPAM.",
  "project_monitoring_solution_title": "Корпоративна система моніторингу",
  "project_monitoring_solution_description": "Впровадив комплексні рішення для моніторингу з використанням Grafana та Zabbix, скоротивши час реагування на інциденти на 60%. Керував інфраструктурою, що обслуговує понад 100 користувачів з 99,9% часу безперебійної роботи системи. Інтегрував сповіщення та системи автоматичного реагування.",
  "project_infrastructure_automation_title": "Проект автоматизації інфраструктури",
  "project_infrastructure_automation_description": "Впровадив автоматизацію інфраструктури, скоротивши час розгортання на 50%. Керував хмарною та локальною інфраструктурою з 99,9% часу безперебійної роботи. Автоматизував робочі процеси, підвищивши продуктивність команди на 40%. Технології: Ansible, Docker, Jenkins, Proxmox.",
  "project_crm_system_title": "CRM-система для охорони здоров'я",
  "project_crm_system_description": "Розробив спеціалізовану CRM-систему для фармацевтичної компанії, скоротивши час обробки на 40%. Впровадив функції автоматизації та інтеграцію з існуючими системами. Створено з використанням сучасного стеку, включаючи React та Firebase."
}