{
  "navbar_home":"Home",
  "navbar_about":"About",
  "navbar_projects":"Projects",
  "navbar_resume":"Resume",
  "home_hi_there":"Hi There!",
  "home_im":"I'M",
  "home_name":"Alex",
  "home_introduce_myself":"LET ME ",
  "home_introduce":"INTRODUCE MYSELF",
  "home_about_description1":"As a DevOps engineer, I specialize in designing scalable solutions and optimizing technical processes across complex infrastructural environments.",
  "home_about_description2":"My expertise encompasses building highly available solutions using Docker and Kubernetes, while implementing efficient automated workflows through Jenkins and modern CI/CD practices.",
  "home_about_description3":"I excel in architecting and optimizing cloud solutions across GCP, Azure, and AWS, achieving maximum performance with optimal resource utilization.",
  "home_about_description4":"Following Agile principles, I drive continuous innovation in project management and infrastructure development, ensuring constant process improvement.",
  "home_find_me_on":"CONNECT WITH ME",
  "home_connect_with_me":"Let's collaborate on innovative solutions",
  "type_certified_professional":"Multi-cloud Systems Engineer",
  "type_linux_system_admin":"Certified in Google Cloud",
  "type_dreamy_devops":"Certified in Amazon Web Services",
  "type_atlassian_administrator":"Certified in Microsoft Azure",
  "type_computer_system_engineer":"Top 1000 Worldwide in Google Skill Boost Challenge (2024)",
  "type_newbie_web_developer":"Driven by complex challenges, I innovate and deliver impactful DevOps solutions that transform business operations.",
  "type_ethnical_hacker":"Certified Ethical Hacker with expertise in cybersecurity fundamentals and advanced security practices, committed to continuous growth in security and infrastructure protection",
  "about_title":"My Professional Journey",
  "professional_skillset":"Professional Skillset",
  "tools_i_use":"Tools I use",
  "about_card_intro":"Hi Everyone, I am ",
  "about_card_from":"IT Engineer from ",
  "about_card_country":"Ukraine",
  "about_card_currently_looking":"Advancing in Systems Engineering, DevOps, and Site Reliability Engineering, I continuously expand my technical horizons and expertise.",
  "about_card_certification":"Certified as a Google Cloud Professional DevOps Engineer, Microsoft Azure Administrator and AWS Cloud Practitioner, demonstrating comprehensive cloud expertise.",
  "about_card_activities_intro":"Apart from self-learning, some other activities that I love to do!",
  "about_card_activity_sport":"Sport activities",
  "about_card_activity_tv":"Watching TV shows",
  "about_card_activity_reading":"Reading books",
  "about_card_quote":"\"DevOpsDive: Engineering Tomorrow's Solutions, Today\" ",
  "bages_and_certificates":"Bages and Certificates",
  "click_to_verify":"click to verify",
  "github_days_i_code":"Days I",
  "github_code":"Code",
  "github_web_hobby":"Web its my hobby",
  "projects_my_recent_works":"Featured Projects",
  "projects_description":"Here are a few projects I've worked on recently.",
  "project_jira_title":"Jira Deployment and Automation",
  "project_jira_description":"Deployed Jira for project management, customizing it with automated scripts for task tracking, sprint planning, and team workflows, thus boosting productivity and aligning with agile methods.",
  "project_docker_compose_title":"Docker-compose Infrastructure",
  "project_docker_compose_description":"Created an infrastructure using Docker-compose, connecting a WordPress site with a MySQL database. Configured the WordPress server on port 8080 and set up MySQL for effective site interaction.",
  "project_proxmox_title":"Proxmox Virtual Data Center",
  "project_proxmox_description":"Deployed a Proxmox-based virtual data center, managing virtual machines and ensuring high reliability with regular backups. This setup guarantees performance and security for all services.",
  "project_nginx_title":"Nginx Configuration",
  "project_nginx_description":"Configured Nginx for domain connection and SSL, enhancing web service security and efficiency. Adjusted server blocks for improved performance, installing SSL for encrypted data transfer.",
  "project_jenkins_title":"Jenkins Implementation",
  "project_jenkins_description":"Set up Jenkins for automated workflows and CI, customizing pipelines and integrating with version control systems. This enhanced development efficiency, speed, and consistency.",
  "project_phbt_title":"Pharmbiotest CRM",
  "project_phbt_description":"Developed a specialized CRM system for Pharmbiotest, enhancing service tracking, client database management, and loyalty programs. Optimized for improved client engagement and streamlined service delivery with advanced database tools.",
  "project_landing_title":"Responsive Landing Page",
  "project_landing_description":"Crafted an adaptive landing page using HTML and CSS, focusing on responsive design. Employed advanced CSS for flexibility across devices, ensuring a seamless user experience.",
  "project_multipage_title":"Foxtar Online Store",
  "project_multipage_description":"Developed the Foxtar Store, a comprehensive online retail platform with user-friendly design. Incorporated e-commerce features like product listings and shopping cart for a complete shopping experience.",
  "project_calculator_title":"Vue.js Calculator",
  "project_calculator_description":"Built an interactive calculator using Vue.js, featuring undo and redo functions. This project showcases Vue.js's capabilities in reactivity and state management.",
  "project_chess_title":"React-based Chess Game",
  "project_chess_description":"Developed a two-player chess game with React, integrating classic rules into a dynamic interface. Efficiently managed game state for enhanced strategic gameplay.",
  "project_fakestore_title":"Fake Store Application",
  "project_fakestore_description":"Developed a React application simulating an e-commerce experience with FakeStoreAPI. Features include browsing products, adding to cart, and understanding API integration.",
  "project_searchapp_title":"GitHub Repository Search App",
  "project_searchapp_description":"Designed a web app for searching GitHub repositories, enabling users to search, view details, and save favorite repositories. Utilizes GitHub's API for real-time data retrieval.",
  "download_cv":"Download CV",
  "select_en_resume":"English CV",
  "select_ua_resume":"Ukrainian CV",
  "select_ru_resume": "Russian CV",
  "footer_copywright_1":"Engineering Tomorrow's Solutions, Today",
  "footer_copywright_2":"Copyright © {{year}} DevOpsDive",
  "all":"All",
  "type_project":"Project",
  "type_task":"Task",
  "active_filters":"Active filter",
  "clear_all":"Clear",
  "showing_results":"Showing {{count}} results",
  "no_results":"No projects found",
  "try_different_filters":"Try different filters",
  "reset_all_filters":"Reset all filters",
  "project_import_automation_title": "Automated Import Job Trigger Tool",
  "project_import_automation_description": "Developed a unified tool to automate import jobs across multiple environments. Improved operational efficiency by simplifying complex processes, reducing time from 15-20 minutes to 1-2 minutes per import. Leveraged Azure Automation for secure execution with proper error handling.",
  "project_logs_viewer_title": "eShop Logs Viewer Application",
  "project_logs_viewer_description": "Created a user-friendly web application for accessing AKS cluster logs, enabling support teams to quickly access and analyze logs without Azure Log Analytics knowledge. Reduced log access time from 5-10 minutes to 30-60 seconds and introduced one-click log downloading.",
  "project_api_clients_tool_title": "Commercetools Unused API Clients Tool",
  "project_api_clients_tool_description": "Developed a Python tool for identifying unused API clients across multiple Commercetools projects, reducing security risks and improving client lifecycle management. Automated previously manual audit processes, cutting analysis time from hours to minutes and providing comprehensive reports.",
  "task_kubernetes_title":"Kubernetes Deployment",
  "task_kubernetes_description":"Deployed Kubernetes clusters with automated scaling, comprehensive monitoring, and optimized resource management, significantly improving application reliability and scalability.",
  "task_aws_title":"AWS Infrastructure Setup",
  "task_aws_description":"Provisioned AWS cloud infrastructure using Terraform, including robust VPC, scalable EC2 instances, and reliable RDS databases, streamlining cloud operations.",
  "task_elk_title":"ELK Stack Implementation",
  "task_elk_description":"Implemented centralized ELK logging solution, significantly enhancing application monitoring, visibility, and incident detection across distributed environments.",
  "task_cloud_migration_title":"Cloud Migration Project",
  "task_cloud_migration_description":"Migrated legacy applications to cloud platforms using Infrastructure as Code, optimizing performance, reducing costs, and achieving scalable deployments.",
  "project_apim_title":"Azure API Management implementation",
  "project_azure_infrastructure_title":"Enterprise Azure Infrastructure",
  "project_apim_description":"Implemented Azure API Management to reduce time and costs. By Infrastructure as Code, optimizing performance, reducing costs, and achieving scalable deployments. ",
  "project_azure_infrastructure_description":"Developed Azure infrastructure with Terraform and GitHub Actions, automating secure microservices deployments. Integrated comprehensive monitoring for improved reliability and faster release cycles.",
  "project_aws_lambda_title":"AWS Lambda Migration & Security",
  "project_aws_lambda_description":"Successfully migrated 50+ AWS Lambda functions to Python 3.11, implemented security assessments, automated testing, and presented expertise at AWS Weeks 2024 events.",
  "project_terraform_infrastructure_title":"IT Marathon Infrastructure",
  "project_terraform_infrastructure_description":"Architected secure cloud infrastructure using Terraform, implementing VPCs, Security Groups, and automated DNS management. Presented solutions to 500+ attendees at EPAM conference.",
  "project_monitoring_solution_title":"Enterprise Monitoring System",
  "project_monitoring_solution_description":"Implemented comprehensive monitoring solutions using Grafana and Zabbix, reducing incident response time by 60%. Managed infrastructure serving 100+ users with 99.9% system uptime. Integrated alerting and automated response systems.",
  "project_infrastructure_automation_title":"Infrastructure Automation Project",
  "project_infrastructure_automation_description":"Implemented infrastructure automation reducing deployment time by 50%. Managed cloud and on-premise infrastructure with 99.9% uptime. Automated workflows increasing team productivity by 40%. Technologies: Ansible, Docker, Jenkins, Proxmox.",
  "project_crm_system_title":"Healthcare CRM System",
  "project_crm_system_description":"Developed specialized CRM system for pharmaceutical company, decreasing processing time by 40%. Implemented automation features and integrated with existing systems. Built with modern stack including React and Firebase.",
  "task_git_optimization_title":"Git Repository Optimization",
  "task_git_optimization_description":"Optimized Git workflows, implementing efficient branching strategies and repository mirroring, achieving faster collaboration and significant storage reduction.",
  "task_backup_solution_title":"Cloud Backup Solution",
  "task_backup_solution_description":"Developed Azure-based automated backup solution for Commercetools with proactive verification, ensuring data protection, quick recovery, and business continuity.",
  "task_kubernetes_setup_title":"Kubernetes Infrastructure Setup",
  "task_kubernetes_setup_description":"Configured Kubernetes infrastructure with optimized ingress and automated microservices scaling, enhancing security, availability, and operational efficiency.",
  "project_bosch_cicd_title":"Enterprise E-Commerce CI/CD Pipeline",
  "project_bosch_cicd_description":"Built CI/CD pipelines for Bosch's e-commerce platform using Jenkins and Azure DevOps, integrated automated testing, and accelerated microservices deployments with Commercetools.",
  "project_gcp_kubernetes_title":"GCP Kubernetes Infrastructure",
  "project_gcp_kubernetes_description":"Built Kubernetes infrastructure on Google Cloud Platform, including autoscaling clusters, pod security policies, load balancing, and integrated Cloud Monitoring for enhanced observability.",
  "project_multicloud_security_title":"Multi-Cloud Security Framework",
  "project_multicloud_security_description":"Developed comprehensive security framework across GCP, AWS, and Azure. Implemented IAM policies, security groups, and network policies. Created automated security compliance checks and remediation procedures. Achieved zero security incidents post-implementation.",
  "project_terraform_automation_title":"Infrastructure as Code Platform",
  "project_terraform_automation_description":"Built enterprise-grade Infrastructure as Code platform using Terraform for multi-cloud deployments. Implemented modular design for reusable components, automated state management, and integrated with CI/CD pipelines. Reduced infrastructure deployment time by 80%.",
  "project_monitoring_platform_title":"Enterprise Monitoring Solution",
  "project_monitoring_platform_description":"Implemented enterprise monitoring platform using Grafana, Prometheus, and custom exporters, enabling real-time alerts, effective incident response, and improved system uptime.",
  "task_lambda_migration_title":"AWS Lambda Python Migration",
  "task_lambda_migration_description":"Migrated 50+ AWS Lambda functions to Python 3.11 with zero downtime, integrating automated testing and pipelines for improved security and deployment consistency.",
  "task_terraform_azure_title":"Azure Infrastructure Automation",
  "task_terraform_azure_description":"Automated Azure deployments using Terraform with modular networking components, reducing provisioning times and ensuring robust infrastructure and security.",
  "task_microservices_deployment_title":"Microservices Platform Setup",
  "task_microservices_deployment_description":"Set up MACH-based microservices architecture with API gateways and automated scaling, significantly boosting deployment speed, reliability, and flexibility.",
  "project_commercetools_backup_title":"Commercetools Data Backup Solution",
  "project_commercetools_backup_description":"Built automated backup solution for Commercetools using Azure Logic Apps, featuring scheduled backups, data validation, and recovery, ensuring reliability and rapid restoration.",
  "project_git_optimization_title":"Git Infrastructure Optimization",
  "project_git_optimization_description":"Optimized Git repositories with efficient branching and GitLab-Bitbucket mirroring, reducing storage by 40% and build times by 50%, enhancing cross-team collaboration.",
  "project_mach_deployment_title":"MACH Composer Automation Platform",
  "project_mach_deployment_description":"Optimized microservices deployments using MACH Composer and GitHub Actions, enabling reusable workflows, environment-specific configs, and automated testing for faster, error-free releases.",
  "task_backup_monitoring_title":"Backup Monitoring System",
  "task_backup_monitoring_description":"Implemented Azure-based monitoring for backup solutions, automating alerts, ensuring swift issue resolution, and maintaining high data reliability.",
  "task_git_workflow_title":"Git Workflow Automation",
  "task_git_workflow_description":"Automated Git workflows with structured branching strategies, pre-commit checks, and quality gates, enhancing code quality, consistency, and productivity.",
  "task_mach_testing_title":"MACH Integration Testing",
  "task_mach_testing_description":"Developed automated integration tests for MACH-based microservices, ensuring high reliability, robust APIs, and significantly reducing deployment risks.",
  "project_git_mirror_title":"Cross-Platform Git Synchronization Solution",
  "project_git_mirror_description":"Implemented seamless repository synchronization between BitBucket and GitLab, enabling efficient cross-team collaboration, real-time code consistency, and simplified access management.",
  "task_mirror_monitoring_title":"Repository Sync Monitoring",
  "task_mirror_monitoring_description":"Built real-time monitoring for Git repository sync processes, enabling quick failure detection, alerting, and maintaining code consistency across platforms.",
  "project_gke_migration_title":"E-commerce Platform Migration to GKE",
  "project_gke_migration_description":"Migrated e-commerce platform to Google Kubernetes Engine, implementing microservices, automated scaling, and monitoring. Reduced response times, enhanced reliability, and lowered infrastructure costs.",
  "project_network_security_title":"GCP Network Security Implementation",
  "project_network_security_description":"Implemented comprehensive network security solution including bastion host setup, IAP configuration, and network segmentation. Eliminated security incidents and achieved complete network isolation with controlled access points.",
  "project_infrastructure_auto_title":"Enterprise Infrastructure Automation",
  "project_infrastructure_auto_description":"Developed end-to-end infrastructure automation for retail platform using Terraform. Reduced provisioning time from 7 days to 25 minutes, achieved 99.8% configuration accuracy, and optimized resource utilization to 78%.",
  "project_canary_deployment_title":"Cloud Run Canary Deployment System",
  "project_canary_deployment_description":"Implemented progressive delivery system using Cloud Run with canary deployments. Achieved zero downtime deployments, 95% reduction in deployment risks, and saved $180K quarterly from prevented incidents.",
  "project_load_balancer_title":"Global HTTP Load Balancer Implementation",
  "project_load_balancer_description":"Designed and implemented global HTTP load balancing solution improving availability from 98.5% to 99.99%. Reduced response time from 2.5s to 0.8s and enabled automated scaling across regions.",
  "project_cicd_pipeline_title":"E-Commerce CI/CD Pipeline",
  "project_cicd_pipeline_description":"Transformed deployment process for e-commerce platform, reducing deployment time from 4 hours to 12 minutes. Achieved 99.9% deployment success rate and implemented instant rollback capability.",
  "category_cloud_platforms": "Cloud Platforms & Services",
  "category_infrastructure": "Infrastructure & DevOps",
  "category_automation": "Automation & CI/CD",
  "category_monitoring": "Monitoring & Observability",
  "category_web_development": "Web Development",
  "category_cloud_engineering_hint":"Cloud platforms expertise: AWS, Azure, GCP, and cloud-native solutions",
  "category_containerization_hint":"Container technologies: Kubernetes, Docker, and microservices architecture",
  "category_automation_cicd_hint":"Continuous Integration/Delivery and deployment automation",
  "category_infrastructure_hint":"Infrastructure as Code and system architecture",
  "category_monitoring_reliability_hint":"System monitoring, observability, and Site Reliability Engineering",
  "category_security_hint":"Security implementation and compliance standards"
}